In [247]:
%load_ext sql
%sql sqlite:///PS1.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Problem Set 1 [100 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on Canvas. Follow the instructions on the file! Upload the file at Canvas.


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

Problem 1: Linear Algebra [30 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented - why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [248]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

Running query in 'sqlite:///PS1.db'

+------------+
|     A      |
+------------+
| 7 , 5 , 8  |
| 10 , 7 , 7 |
| 2 , 0 , 5  |
+------------+

In [249]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

Running query in 'sqlite:///PS1.db'

+------------+
|     B      |
+------------+
| 9 , 6 , 10 |
| 7 , 6 , 9  |
| 1 , 1 , 7  |
+------------+

### Part (a): Matrix addition [5 points]

The sum of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $n\times m$) is the matrix $C$ (of dimension $n\times m$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = A_{ij} + B_{ij}$

Write a single SQL query to get the sum of $A$ and $B$ (in the same format as $A$ and $B$):

In [10]:
%%sql
SELECT * from A

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 0 |  7  |
| 0 | 1 |  5  |
| 0 | 2 |  8  |
| 1 | 0 |  10 |
| 1 | 1 |  7  |
| 1 | 2 |  7  |
| 2 | 0 |  2  |
| 2 | 1 |  0  |
| 2 | 2 |  5  |
+---+---+-----+

In [11]:
%%sql
SELECT * from B

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 0 |  9  |
| 0 | 1 |  6  |
| 0 | 2 |  10 |
| 1 | 0 |  7  |
| 1 | 1 |  6  |
| 1 | 2 |  9  |
| 2 | 0 |  1  |
| 2 | 1 |  1  |
| 2 | 2 |  7  |
+---+---+-----+

In [ ]:
%%sql
SELECT a.i, a.j, a.val + b.val as val 
FROM A a
JOIN B b 
ON b.i = a.i 
AND b.j = a.j

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 0 |  16 |
| 0 | 1 |  11 |
| 0 | 2 |  18 |
| 1 | 0 |  17 |
| 1 | 1 |  13 |
| 1 | 2 |  16 |
| 2 | 0 |  3  |
| 2 | 1 |  1  |
| 2 | 2 |  12 |
+---+---+-----+

In [6]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 0 |  16 |
| 0 | 1 |  11 |
| 0 | 2 |  18 |
| 1 | 0 |  17 |
| 1 | 1 |  13 |
| 1 | 2 |  16 |
| 2 | 0 |  3  |
| 2 | 1 |  1  |
| 2 | 2 |  12 |
+---+---+-----+

### Part (b): Dot product [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **first column of $A$** and the **second column of $B$.**:

In [19]:
%%sql
select * from B b
where b.j = 1

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 1 |  6  |
| 1 | 1 |  6  |
| 2 | 1 |  1  |
+---+---+-----+

In [251]:
%%sql
SELECT sum(a.val * b.val) AS DotProduct
FROM A 
JOIN B b 
ON a.i = b.i
WHERE a.j = 0 
AND b.j = 1

Running query in 'sqlite:///PS1.db'

+------------+
| DotProduct |
+------------+
|    104     |
+------------+

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+------------+
| DotProduct |
+------------+
|    104     |
+------------+

### Part (c): Matrix multiplication [10 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$):

In [30]:
%config SqlMagic.displaylimit = 100

In [252]:
%%sql
SELECT 
    a.i,
    b.j,
    SUM(a.val * b.val) AS val
FROM A a
JOIN B b 
ON a.j = b.i
GROUP BY a.i, b.j;

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 0 | 106 |
| 0 | 1 |  80 |
| 0 | 2 | 171 |
| 1 | 0 | 146 |
| 1 | 1 | 109 |
| 1 | 2 | 212 |
| 2 | 0 |  23 |
| 2 | 1 |  17 |
| 2 | 2 |  55 |
+---+---+-----+

In [8]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+---+---+-----+
| i | j | val |
+---+---+-----+
| 0 | 0 | 106 |
| 0 | 1 |  80 |
| 0 | 2 | 171 |
| 1 | 0 | 146 |
| 1 | 1 | 109 |
| 1 | 2 | 212 |
| 2 | 0 |  23 |
| 2 | 1 |  17 |
| 2 | 2 |  55 |
+---+---+-----+

### Part (d): Matrix operations [10 points]

In the previous question, we obtained the resulting matrix $C$ by multiplying two matrices $A$ and $B$. Each element in $C$ was computed using the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a _single SQL query_ that computes the resulting matrix $R$, which is the **square** of matrix $A$ plus 2 times the **square** of matrix $C$, in other words, $R = A \cdot A + 2 \cdot (C \cdot C) = A \cdot A + 2 \cdot ((A \cdot B) \cdot (A \cdot B))$:

In [81]:
%%sql
SELECT 
    a.i,
    b.j,
    SUM(a.val * b.val) AS "(A * A)"
FROM A a
JOIN A b 
ON a.j = b.i
GROUP BY a.i, b.j;

Running query in 'sqlite:///PS1.db'

+---+---+---------+
| i | j | (A * A) |
+---+---+---------+
| 0 | 0 |   115   |
| 0 | 1 |    70   |
| 0 | 2 |   131   |
| 1 | 0 |   154   |
| 1 | 1 |    99   |
| 1 | 2 |   164   |
| 2 | 0 |    24   |
| 2 | 1 |    10   |
| 2 | 2 |    41   |
+---+---+---------+

In [253]:
%%sql
WITH 
A_squared AS (
    SELECT a1.i, a2.j, SUM(a1.val * a2.val) AS val
    FROM A a1 JOIN A a2 ON a1.j = a2.i
    GROUP BY a1.i, a2.j
),
C AS (
    SELECT a.i, b.j, SUM(a.val * b.val) AS val
    FROM A a JOIN B b ON a.j = b.i
    GROUP BY a.i, b.j
),
C_squared AS (
    SELECT c1.i, c2.j, SUM(c1.val * c2.val) AS val
    FROM C c1 JOIN C c2 ON c1.j = c2.i
    GROUP BY c1.i, c2.j
)
SELECT 
    a_sq.i,
    a_sq.j,
    a_sq.val + 2 * c_sq.val AS val
FROM A_squared a_sq
JOIN C_squared c_sq ON a_sq.i = c_sq.i AND a_sq.j = c_sq.j
ORDER BY a_sq.i, a_sq.j;

Running query in 'sqlite:///PS1.db'

+---+---+--------+
| i | j |  val   |
+---+---+--------+
| 0 | 0 | 53813  |
| 0 | 1 | 40284  |
| 0 | 2 | 89113  |
| 1 | 0 | 72686  |
| 1 | 1 | 54429  |
| 1 | 2 | 119632 |
| 2 | 0 | 12394  |
| 2 | 1 |  9266  |
| 2 | 2 | 21165  |
+---+---+--------+

In [9]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+---+---+--------+
| i | j |  val   |
+---+---+--------+
| 0 | 0 | 53813  |
| 0 | 1 | 40284  |
| 0 | 2 | 89113  |
| 1 | 0 | 72686  |
| 1 | 1 | 54429  |
| 1 | 2 | 119632 |
| 2 | 0 | 12394  |
| 2 | 1 |  9266  |
| 2 | 2 | 21165  |
+---+---+--------+

Problem 2: The Sales Database [35 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store, WeekDate, Temperature, FuelPrice, CPI, UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

### Part (a): Sales during Holidays [10 points]

Using a _single SQL query_, find the store(s) with the largest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [ ]:
%%sql
SELECT s.store, sum(s.weeklysales) AS AllSales
FROM Sales s
JOIN Holidays h ON h.weekdate = s.weekdate
WHERE h.IsHoliday = 'TRUE'
GROUP BY s.store
ORDER BY AllSales desc
LIMIT 1;

Running query in 'sqlite:///PS1.db'

+-------+-------------+
| store |   AllSales  |
+-------+-------------+
|   20  | 22490350.81 |
+-------+-------------+

In [10]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+-------+-------------+
| Store |   AllSales  |
+-------+-------------+
|   20  | 22490350.81 |
+-------+-------------+

### Part (b): When Holidays do not help Sales [15 points]

Using a _single SQL query_, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumberNonHolidays)`.

Write your query here:

In [254]:
%%sql
WITH
Holiday_Week_Average AS (
    SELECT AVG(weekly_total) AS HolidaySalesAvg
    FROM (
        SELECT h.weekdate, SUM(s.weeklysales) AS weekly_total
        FROM Sales s
        JOIN Holidays h ON h.weekdate = s.weekdate
        WHERE h.IsHoliday = 'TRUE'
        GROUP BY h.weekdate
    ) holiday_totals
),
Weekly_Averages AS (
    SELECT h.weekdate, h.isholiday, SUM(s.weeklysales) AS WeekAvg
    FROM Sales s
    JOIN Holidays h ON h.weekdate = s.weekdate
    GROUP BY h.weekdate, h.isholiday
)
SELECT COUNT(*) AS NumberNonHolidays
FROM Holiday_Week_Average h
CROSS JOIN Weekly_Averages w
WHERE w.WeekAvg > h.HolidaySalesAvg
    AND w.isholiday = 'FALSE';

Running query in 'sqlite:///PS1.db'

+-------------------+
| NumberNonHolidays |
+-------------------+
|         8         |
+-------------------+

In [11]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+-------------------+
| NumberNonHolidays |
+-------------------+
|         8         |
+-------------------+

### Part (c): Total Summer Sales [10 points]

Using a _single SQL query_, compute the average winter sales (months 12,1,and 2) for each type of store. Further requirements:
* Return a relation with schema `(type, AvgSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [146]:
%sql PRAGMA table_info(Sales);

Running query in 'sqlite:///PS1.db'

+-----+-------------+---------+---------+------------+----+
| cid |     name    |   type  | notnull | dflt_value | pk |
+-----+-------------+---------+---------+------------+----+
|  0  |    store    | INTEGER |    0    |    None    | 1  |
|  1  |     dept    | INTEGER |    0    |    None    | 2  |
|  2  |   weekdate  |   DATE  |    0    |    None    | 3  |
|  3  | weeklysales |   REAL  |    0    |    None    | 0  |
+-----+-------------+---------+---------+------------+----+

In [155]:
%%sql
SELECT s.type, AVG(sa.weeklysales) as AvgSales
FROM Stores s
JOIN Sales sa ON s.store = sa.store
where strftime('%m', sa.weekdate) in ('12', '01', '02')
GROUP BY s.type;

Running query in 'sqlite:///PS1.db'

+------+--------------------+
| type |      AvgSales      |
+------+--------------------+
|  A   | 20884.924470966464 |
|  B   | 12858.744532384506 |
|  C   | 9583.168305027557  |
+------+--------------------+

In [12]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+------+--------------------+
| type |      AvgSales      |
+------+--------------------+
|  A   | 20884.924470966464 |
|  B   | 12858.744532384506 |
|  C   | 9583.168305027557  |
+------+--------------------+

Problem 3: The Traveling SQL Server Salesman Problem [35 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [157]:
%sql SELECT * FROM streets LIMIT 100;

Running query in 'sqlite:///PS1.db'

+----+-----------+----------------------+----------------------+---+
| id | direction |          A           |          B           | d |
+----+-----------+----------------------+----------------------+---+
| 0  |     F     |      UW-Madison      | DooHickey Collective | 7 |
| 0  |     R     | DooHickey Collective |      UW-Madison      | 7 |
| 1  |     F     | DooHickey Collective |      Gizmo Corp      | 2 |
| 1  |     R     |      Gizmo Corp      | DooHickey Collective | 2 |
| 2  |     F     |      UW-Madison      |     Gadget Corp      | 6 |
| 2  |     R     |     Gadget Corp      |      UW-Madison      | 6 |
| 3  |     F     |     Gadget Corp      |    DooHickey Corp    | 3 |
| 3  |     R     |    DooHickey Corp    |     Gadget Corp      | 3 |
| 4  |     F     |      Gizmo Corp      |     GadgetWorks      | 8 |
| 4  |     R     |     GadgetWorks      |      Gizmo Corp      | 8 |
| 5  |     F     |      UW-Madison      |  Gadget Collective   | 9 |
| 5  |     R     |  Gadget Collective   |      UW-Madison      | 9 |
| 6  |     F     |      Gizmo Corp      |  Widget Industries   | 1 |
| 6  |     R     |  Widget Industries   |      Gizmo Corp      | 1 |
| 7  |     F     |     Gadget Corp      |  Gadget Industries   | 9 |
| 7  |     R     |  Gadget Industries   |     Gadget Corp      | 9 |
| 8  |     F     |    DooHickey Corp    |    DooHickeyWorks    | 3 |
| 8  |     R     |    DooHickeyWorks    |    DooHickey Corp    | 3 |
| 9  |     F     |  Gadget Industries   |     Widget Corp      | 5 |
| 9  |     R     |     Widget Corp      |  Gadget Industries   | 5 |
| 10 |     F     |    DooHickey Corp    |       ThingCo        | 6 |
| 10 |     R     |       ThingCo        |    DooHickey Corp    | 6 |
| 11 |     F     |  Gadget Collective   |      GizmoWorks      | 3 |
| 11 |     R     |      GizmoWorks      |  Gadget Collective   | 3 |
| 12 |     F     |  Widget Industries   |   Gizmo Industries   | 1 |
| 12 |     R     |   Gizmo Industries   |  Widget Industries   | 1 |
| 13 |     F     |    DooHickeyWorks    |   Thing Industries   | 1 |
| 13 |     R     |   Thing Industries   |    DooHickeyWorks    | 1 |
| 14 |     F     |   Thing Industries   |  Widget Collective   | 2 |
| 14 |     R     |  Widget Collective   |   Thing Industries   | 2 |
| 15 |     F     |   Thing Industries   |   Gizmo Collective   | 3 |
| 15 |     R     |   Gizmo Collective   |   Thing Industries   | 3 |
| 16 |     F     |  Widget Collective   |     DooHickeyCo      | 2 |
| 16 |     R     |     DooHickeyCo      |  Widget Collective   | 2 |
| 17 |     F     |     DooHickeyCo      |   Thing Collective   | 9 |
| 17 |     R     |   Thing Collective   |     DooHickeyCo      | 9 |
| 18 |     F     |     DooHickeyCo      |      Thing Corp      | 6 |
| 18 |     R     |      Thing Corp      |     DooHickeyCo      | 6 |
| 19 |     F     |  Widget Collective   |     WidgetWorks      | 1 |
| 19 |     R     |     WidgetWorks      |  Widget Collective   | 1 |
| 20 |     F     |  Widget Collective   |       GadgetCo       | 7 |
| 20 |     R     |       GadgetCo       |  Widget Collective   | 7 |
| 21 |     F     |      Thing Corp      |       GizmoCo        | 4 |
| 21 |     R     |       GizmoCo        |      Thing Corp      | 4 |
| 22 |     F     |      Thing Corp      | DooHickey Industries | 3 |
| 22 |     R     | DooHickey Industries |      Thing Corp      | 3 |
| 23 |     F     | DooHickey Industries |       WidgetCo       | 1 |
| 23 |     R     |       WidgetCo       | DooHickey Industries | 1 |
| 24 |     F     |       GizmoCo        |      ThingWorks      | 5 |
| 24 |     R     |      ThingWorks      |       GizmoCo        | 5 |
| 25 |     F     |       GadgetCo       |   Thing Industries   | 9 |
| 25 |     R     |   Thing Industries   |       GadgetCo       | 9 |
+----+-----------+----------------------+----------------------+---+

### Part (a): One-hop, two-hop, three-hop... [15 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 10 miles of UW-Madison_ and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [199]:
%%sql
SELECT B, d 
FROM streets
WHERE A = "UW-Madison"
AND d <= 10

Running query in 'sqlite:///PS1.db'

+----------------------+---+
|          B           | d |
+----------------------+---+
| DooHickey Collective | 7 |
|     Gadget Corp      | 6 |
|  Gadget Collective   | 9 |
+----------------------+---+

In [198]:
%%sql
SELECT s.B, s.d + s1.d AS TOTAL_DIST
FROM 
(
SELECT A, B, d 
FROM streets
WHERE A = "UW-Madison"
AND d <= 10
) s1
JOIN streets s ON s.A = s1.B
WHERE s.B != "UW-Madison" AND TOTAL_DIST <= 10

Running query in 'sqlite:///PS1.db'

+----------------+------------+
|       B        | TOTAL_DIST |
+----------------+------------+
|   Gizmo Corp   |     9      |
| DooHickey Corp |     9      |
+----------------+------------+

In [197]:
%%sql
SELECT s.B, s.d + s2.TOTAL_DIST AS TOTAL_DIST_S3
FROM 
(
  SELECT s.B, s.d + s1.d AS TOTAL_DIST
  FROM 
  (
    SELECT A, B, d 
    FROM streets
    WHERE A = "UW-Madison"
    AND d <= 10
  ) s1
  JOIN streets s ON s.A = s1.B
  WHERE s.B != "UW-Madison" AND TOTAL_DIST <= 10
) s2 
JOIN streets s ON s.A = s2.B
WHERE TOTAL_DIST_S3 <= 10

Running query in 'sqlite:///PS1.db'

+-------------------+---------------+
|         B         | TOTAL_DIST_S3 |
+-------------------+---------------+
| Widget Industries |       10      |
+-------------------+---------------+

In [ ]:
%%sql
SELECT company, distance
FROM (
    SELECT B AS company, d AS distance
    FROM streets
    WHERE A = "UW-Madison" AND d <= 10
    
    UNION ALL
    
    SELECT s2.B AS company, (s1.d + s2.d) AS distance
    FROM streets s1
    JOIN streets s2 ON s1.B = s2.A
    WHERE s1.A = "UW-Madison" 
      AND s1.d <= 10
      AND (s1.d + s2.d) <= 10
      AND s2.B != "UW-Madison"
      AND s2.B != s1.A
    
    UNION ALL
    
    SELECT s3.B AS company, (s1.d + s2.d + s3.d) AS distance
    FROM streets s1
    JOIN streets s2 ON s1.B = s2.A
    JOIN streets s3 ON s2.B = s3.A
    WHERE s1.A = "UW-Madison"
      AND s1.d <= 10
      AND (s1.d + s2.d) <= 10
      AND (s1.d + s2.d + s3.d) <= 10
      AND s3.B != "UW-Madison"
      AND s3.B NOT IN (s1.A, s2.A)
) subquery
ORDER BY company;

Running query in 'sqlite:///PS1.db'

+----------------------+----------+
|       company        | distance |
+----------------------+----------+
| DooHickey Collective |    7     |
|    DooHickey Corp    |    9     |
|  Gadget Collective   |    9     |
|     Gadget Corp      |    6     |
|      Gizmo Corp      |    9     |
|  Widget Industries   |    10    |
+----------------------+----------+

In [14]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+----------------------+----------+
|       company        | distance |
+----------------------+----------+
| DooHickey Collective |    7     |
|    DooHickey Corp    |    9     |
|  Gadget Collective   |    9     |
|     Gadget Corp      |    6     |
|      Gizmo Corp      |    9     |
|  Widget Industries   |    10    |
+----------------------+----------+

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be within 2 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _do not include_ $B \rightarrow A$ in your answer!

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [211]:
%%sql
SELECT DISTINCT company AS "Companies 2 hops from UW-Madison"
FROM (
    SELECT B AS company, d AS distance
    FROM streets
    WHERE A = "UW-Madison"
    
    UNION ALL
    
    SELECT s2.B AS company, (s1.d + s2.d) AS distance
    FROM streets s1
    JOIN streets s2 ON s1.B = s2.A
    WHERE s1.A = "UW-Madison" 
      AND s2.B != "UW-Madison"
      AND s2.B != s1.A
) subquery
ORDER BY company;

Running query in 'sqlite:///PS1.db'

+----------------------------------+
| Companies 2 hops from UW-Madison |
+----------------------------------+
|       DooHickey Collective       |
|          DooHickey Corp          |
|        Gadget Collective         |
|           Gadget Corp            |
|        Gadget Industries         |
|            Gizmo Corp            |
|            GizmoWorks            |
+----------------------------------+

In [233]:
%%sql
SELECT 
    route_uw_to_b.company AS company_1,
    route_a_to_uw.company AS company_2,
    route_a_to_uw.distance + route_uw_to_b.distance AS distance
FROM (
    SELECT B AS company, d AS distance
    FROM streets
    WHERE A = "UW-Madison"
    
    UNION ALL
    
    SELECT s1.B AS company, (s1.d + s2.d) AS distance
    FROM streets s1
    JOIN streets s2 ON s1.B = s2.A
    WHERE s1.A = "UW-Madison" 
      AND s2.B != "UW-Madison"
      AND s2.B != s1.A
) route_a_to_uw
CROSS JOIN (
    SELECT B AS company, d AS distance
    FROM streets
    WHERE A = "UW-Madison"
    
    UNION ALL
    
    SELECT s2.B AS company, (s1.d + s2.d) AS distance
    FROM streets s1
    JOIN streets s2 ON s1.B = s2.A
    WHERE s1.A = "UW-Madison"
      AND s2.B != "UW-Madison"
      AND s2.B != s1.A
) route_uw_to_b
WHERE route_a_to_uw.company < route_uw_to_b.company
  AND route_a_to_uw.distance + route_uw_to_b.distance <= 15
ORDER BY company_1;

Running query in 'sqlite:///PS1.db'

+-------------+----------------------+----------+
|  company_1  |      company_2       | distance |
+-------------+----------------------+----------+
| Gadget Corp | DooHickey Collective |    13    |
| Gadget Corp |  Gadget Collective   |    15    |
| Gadget Corp | DooHickey Collective |    15    |
|  Gizmo Corp |     Gadget Corp      |    15    |
+-------------+----------------------+----------+

Write your query or queries here:

In [17]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+-------------+----------------------+----------+
|  company_1  |      company_2       | distance |
+-------------+----------------------+----------+
| Gadget Corp | DooHickey Collective |    13    |
| Gadget Corp |    DooHickey Corp    |    15    |
| Gadget Corp |  Gadget Collective   |    15    |
|  Gizmo Corp |     Gadget Corp      |    15    |
+-------------+----------------------+----------+

### Part (c): Finding Triangles [10 points]

Finally, our salesperson wants to find the longest route that goes from some company $A$ to company $B$ to company $C$ and then back to company $A$. Also, the following constraints must hold:
* $A$, $B$, $C$ must be different companies
* Do not use `WITH` 
* Output only the length of the longest route

Write your query here:

In [246]:
%%sql
SELECT (s1.d + s2.d + s3.d) AS LongestDistance
FROM streets s1
JOIN streets s2 ON s1.B = s2.A
JOIN streets s3 ON s2.B = s3.A
WHERE s2.B != s1.A
  AND s3.B = s1.A
ORDER BY LongestDistance
LIMIT 1;

Running query in 'sqlite:///PS1.db'

+-----------------+
| LongestDistance |
+-----------------+
|        18       |
+-----------------+

In [18]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Running query in 'sqlite:///PS1.db'

+-----------------+
| LongestDistance |
+-----------------+
|        18       |
+-----------------+